#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/glich-stream/ci-cd-staging/runs/run-v7wcDM7NXKBmhJhJ

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.server: Refreshing state... [id=yjmSox6KuG4]
random_id.server_1638473245: Refreshing state... [id=20s7V2V2L4E]
aws_key_pair.staging_key: Refreshing state... [id=staging-key]
aws_instance.staging_cicd_demo_1638473245: Refreshing state... [id=i-050020a8f09d821e8]
aws_instance.staging_cicd_demo: Refreshing state... [id=i-0c7721d661d987bd1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo_1638473245 will be destroyed
  - resource "aws_instance" "staging_cicd_demo_1638473245" {
      - ami                                  = "ami-0bebb7b43b1557724" -> null
      - arn                                  = "arn:aws:ec2:eu-west-1:730880032795:instance/i-050020a8f09d821e8" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-west-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-050020a8f09d821e8" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "staging-key" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-01ead360ca264d44c" -> null
      - private_dns                          = "ip-172-31-32-14.eu-west-1.compute.internal" -> null
      - private_ip                           = "172.31.32.14" -> null
      - public_dns                           = "ec2-34-244-12-123.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                            = "34.244.12.123" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "default",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-03d89c8d5433bd4dd" -> null
      - tags                                 = {
          - "Name" = "staging_cicd_demo-db4b3b5765762f81"
        } -> null
      - tags_all                             = {
          - "Name" = "staging_cicd_demo-db4b3b5765762f81"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-0d2411db69a112a30",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06530a15275ac4f11" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.staging_cicd_demo_1638474117 will be created
  + resource "aws_instance" "staging_cicd_demo_1638474117" {
      + ami                                  = "ami-0bebb7b43b1557724"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0d2411db69a112a30",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # random_id.server_1638473245 will be destroyed
  - resource "random_id" "server_1638473245" {
      - b64_std     = "20s7V2V2L4E=" -> null
      - b64_url     = "20s7V2V2L4E" -> null
      - byte_length = 8 -> null
      - dec         = "15801788964109954945" -> null
      - hex         = "db4b3b5765762f81" -> null
      - id          = "20s7V2V2L4E" -> null
      - keepers     = {
          - "ami_id" = "ami-0bebb7b43b1557724"
        } -> null
    }

  # random_id.server_1638474117 will be created
  + resource "random_id" "server_1638474117" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "ami_id" = "ami-0bebb7b43b1557724"
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - staging_dns_1638473245 = "ec2-34-244-12-123.eu-west-1.compute.amazonaws.com" -> null
  + staging_dns_1638474117 = (known after apply)

```

</details>

*Pusher: @Link-, Action: `pull_request`*